manrussell/stm8_audio_delay/main.c
/**
  ******************************************************************************
  * @file    Project/main.c
  * @author  MCD Application Team
  * @version V2.2.0
  * @date    30-September-2014
  * @brief   Main program body
   ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2014 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software
  * distributed under the License is distributed on an "AS IS" BASIS,
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

    /*
        Pins uC
        =======
from stm8CubeMx...

        spi sclk pc-5
        spi sdi pc-6
        spi spo pc-7

        spi cs ram chip pa-1
        spi cs dac cip pc-4

    */
/*
I might have borken all the Test functions now i am using multichannel ADC's
Why do the spi finction need a delay_us(1) -> is the caputre flag set correctly?
*/

/* Includes ------------------------------------------------------------------*/
#include "stm8s.h"
#include "delay.h"
//#include "mcp_23k256_spi_ram.h"

/* Private defines -----------------------------------------------------------*/
#define LED_pin                     GPIO_PIN_4
#define LED_port                    GPIOD

#define DAC_CS_pin                  GPIO_PIN_4
#define DAC_CS_port                 GPIOC

#define RAM_CS_pin                  GPIO_PIN_1
#define RAM_CS_port                 GPIOA

//ADC
#define ADC_port                    GPIOB
#define ADC_LEFTCHANNEL_IN_pin      GPIO_PIN_0 // % ??
#define ADC_LEFTCHANNEL             0

#define ADC_FEEDBACK_AMOUNT_pin     GPIO_PIN_1 // % ??
#define ADC_FEEDBACK_AMOUNT         1

#define ADC_DELAY_LENGTH_pin        GPIO_PIN_2 // ms ??
#define ADC_DELAY_LENGTH            2

#define ADC_DRYWETMIX_pin           GPIO_PIN_3
#define ADC_DRYWETMIX               3

#define ADC_ELSE_pin                GPIO_PIN_4 // not used so far
#define ADC_ELSE                    4

#define ADC_Multichannel_pins                   ((GPIO_Pin_TypeDef)(ADC_LEFTCHANNEL_IN_pin | ADC_FEEDBACK_AMOUNT_pin | ADC_DELAY_LENGTH_pin | ADC_DRYWETMIX_pin ))




/*
put all gpio stuff here ie MOSI/MISO stuff don't leav it in the init function
*/

// INSTRUCTION SET SRAM
#define READ        0x03            // Read data from memory
#define WRITE       0x02            // Write data to memory
#define RDSR        0x05            // Read Status register
#define WRSR        0x01            // Write Status register

// STATUS REGISTER
#define BYTE_MODE   0x00
#define PAGE_MODE   0x80
#define SEQ_MODE    0x40

//SRAM SIZE
#define SRAM_SIZE 32000

/* Private function prototypes -----------------------------------------------*/
void setup(void);
void clock_setup(void);
void GPIO_setup(void);
void SPI_setup(void);
void ADC1_setup(void);
// void TIM2_setup(void);
void SPI_setup(void);

//spi device 1 DAC
void MCP4901_DAC_write(unsigned char value);
void MCP4901_DAC_init(void);

//spi device 2 RAM
void MCP_23K256_init(void);
void MCP_23K256_RAM_read_byte(uint16_t address, unsigned char *value);
void MCP_23K256_RAM_write_byte(uint16_t address, unsigned char value);
// status registers
void MCP_23K256_read_status_register(uint8_t *data);
void MCP_23K256_write_status_register(uint8_t data);

void delay_us(unsigned int value);
void delay_ms(unsigned int value);

//tests, used while setting up hardware.
uint8_t TEST_ram_test_001(void);
uint8_t TEST_rampfunc_in_ram_to_dac(void);
void    TEST_adc_to_dac(uint8_t *x);
void    TEST_adc_to_ram_to_dac(void);
void    TEST_adc_to_ram_to_dac_with_delay(void);
void    TEST_adc_to_ram_to_dac_with_with_fback(void);

/* Private functions ---------------------------------------------------------*/

void main( void )
{
    uint16_t adc_leftChannel = 0;
    uint16_t adc_feedback    = 0;
    uint16_t adc_delay       = 0;
    uint8_t  mapd_value      = 0;    // mapped adc valu
    uint8_t  read_val        = 0;    // read val from ram
    uint16_t write_addr      = 0;    // write addr in ram
    uint16_t read_addr       = 0;    // read addr in val
    uint16_t delay           = 110;  // length of delay in samples
    uint8_t  res             = 0;

    clock_setup();
    GPIO_setup();
    ADC1_setup();
    SPI_setup();
    MCP_23K256_init();
    MCP4901_DAC_init();

/*
    res = TEST_ram_test_001();
    if(res != 0)
    {
        while(1);
    }

    TEST_adc_to_dac(&adc_val);

    res = TEST_rampfunc_in_ram_to_dac();
    if(res != 0)
    {
        while(1);
    }

    TEST_adc_to_ram_to_dac();

    TEST_adc_to_ram_to_dac_with_delay();

    TEST_adc_to_ram_to_dac_with_with_fback();
*/

    //TEST_rampfunc_in_ram_to_dac();


  /* Infinite loop */
  while (1)
  {
        // multi channel ADC's
            // how long does the scantake? meaaure this start/stop -> gpio-> oscilloscope
            // will want to separate the knobs from signal input,
            //
        ADC1_ScanModeCmd( ENABLE );
        ADC1_StartConversion( );
        while( ADC1_GetFlagStatus( ADC1_FLAG_EOC ) == FALSE );
        ADC1_ClearFlag(ADC1_FLAG_EOC);
        adc_leftChannel = ADC1_GetBufferValue( 0); //ADC_LEFTCHANNEL );     // 0
        adc_delay       = ADC1_GetBufferValue( 1); //ADC_FEEDBACK_AMOUNT ); // 1
        //adc_delay       = ADC1_GetBufferValue( ADC_DELAY_LENGTH );
        //ADC1_ClearFlag( ADC1_FLAG_EOC );

        //untested: set delay length (vari length delay) using adc
        delay = ( adc_delay << 2 ); //(adc_delay >> 2);

    // map function 10bit to 8bit
        // (x - in_min) * (out_max - out_min) / (in_max - in_min) + out_min;
        // input range 0-1024 out range 0-255 therefore
        // slope = (255 - 0) / (1024 - 0); == 0.25 note float!!
        // function simplfys down to
        mapd_value = (adc_leftChannel >> 2);

        //with feedback 50% wet
        mapd_value = mapd_value/2 +  read_val/2;

    // sort out read addresses
        if( (write_addr - delay) < 0)
        {
            //start up situation
            read_addr = SRAM_SIZE - delay + write_addr;
        }

        if( (write_addr - delay) >= 0)
        {
            read_addr = write_addr - delay;
        }

