manrussell/stm8_audio_delay/main.c
    //write value to dac
        MCP4901_DAC_write(read_val);

    //increment write pointer
        write_addr++;

    //11kHz sample rate
        delay_us(90);


    }
}



void TEST_adc_to_ram_to_dac_with_with_fback(void)
{

    uint16_t adc0_val = 0;  //er are these 8 or 16 big?
    uint16_t adc1_val = 0;
    uint8_t mapd_value = 0; // mapped adc valu
    uint8_t read_val = 0;   //read val from ram
    uint16_t write_addr = 0;    //write addr in ram
    uint16_t read_addr = 0; // read addr in val
    uint16_t delay = 110; // length of delay in samples
    uint8_t res = 0;

  /* Infinite loop */
  while (1)
  {
    //Sample value
    /*
    original one adc version
        ADC1_StartConversion();
        while(ADC1_GetFlagStatus(ADC1_FLAG_EOC) == FALSE);

        adc_val = ADC1_GetConversionValue(); // for led knob
        ADC1_ClearFlag(ADC1_FLAG_EOC);
    */
    // multi channel ADC's
    ADC1_ScanModeCmd(ENABLE);
    ADC1_StartConversion();
    while(ADC1_GetFlagStatus(ADC1_FLAG_EOC) == FALSE);
    // ADC1_ClearFlag(ADC1_FLAG_EOC);
    adc0_val = ADC1_GetBufferValue(0);
    adc1_val = ADC1_GetBufferValue(1);
    ADC1_ClearFlag(ADC1_FLAG_EOC);

    //untested: set delay length (vari length delay) using adc
    delay = (adc1_val>>2);

    // knob for feedback
    // knob for gain of ..

    // map function
        // (x - in_min) * (out_max - out_min) / (in_max - in_min) + out_min;
        // input range 0-1024 out range 0-255 therefore
        // slope = (255 - 0) / (1024 - 0); == 0.25 note float!!
        // function simplfys down to
        mapd_value = (adc0_val>>2) ; // do i need the float or not ??? -No use a lft shift

        // add in 16 bit then reduce down to 8 bit

        //with feedback 50% wet
        mapd_value = mapd_value/2 +  read_val/2; // do i need the float or not ???

    // sort out read addresses
        if( (write_addr - delay) < 0)
        {
            //start up situation
            read_addr = SRAM_SIZE - delay + write_addr;
        }

        if( (write_addr - delay) >= 0)
        {
            read_addr = write_addr - delay;
        }

    //write to ram
        MCP_23K256_RAM_write_byte(write_addr, mapd_value);

    //read from ram
        MCP_23K256_RAM_read_byte(read_addr, &read_val);

    //write value to dac
        MCP4901_DAC_write(read_val);

    //increment write pointer
        write_addr++;

    //11kHz sample rate
        delay_us(90);

    }

}

void clock_setup(void)
{
  CLK_DeInit();

  CLK_HSECmd(DISABLE);
  CLK_LSICmd(DISABLE);
  CLK_HSICmd(ENABLE);
  while(CLK_GetFlagStatus(CLK_FLAG_HSIRDY) == FALSE);

  CLK_ClockSwitchCmd(ENABLE);
  CLK_HSIPrescalerConfig(CLK_PRESCALER_HSIDIV1);
  CLK_SYSCLKConfig(CLK_PRESCALER_CPUDIV1);

  CLK_ClockSwitchConfig(CLK_SWITCHMODE_AUTO, CLK_SOURCE_HSI, DISABLE, CLK_CURRENTCLOCKSTATE_ENABLE);

  CLK_PeripheralClockConfig(CLK_PERIPHERAL_I2C, DISABLE);
  CLK_PeripheralClockConfig(CLK_PERIPHERAL_SPI, ENABLE);
  CLK_PeripheralClockConfig(CLK_PERIPHERAL_UART1, DISABLE);
  CLK_PeripheralClockConfig(CLK_PERIPHERAL_AWU, DISABLE);
  CLK_PeripheralClockConfig(CLK_PERIPHERAL_ADC, ENABLE);
  CLK_PeripheralClockConfig(CLK_PERIPHERAL_TIMER1, DISABLE);
  CLK_PeripheralClockConfig(CLK_PERIPHERAL_TIMER2, ENABLE);
  CLK_PeripheralClockConfig(CLK_PERIPHERAL_TIMER4, DISABLE);

}

void GPIO_setup(void)
{
  GPIO_DeInit(GPIOC);
  //GPIO_Init(GPIOC, ((GPIO_Pin_TypeDef)GPIO_PIN_5 | GPIO_PIN_6), GPIO_MODE_OUT_PP_HIGH_FAST);

// ADC, we have to set out ADC pin as a floating GPIO with no interrupt capability:
  //adc pin b0
    GPIO_DeInit(ADC_port);
  //GPIO_Init(GPIOB, GPIO_PIN_0, GPIO_MODE_IN_FL_NO_IT);

    //more adc pins
    // GPIO_Init(GPIOB, GPIO_PIN_0 | GPIO_PIN_0  , GPIO_MODE_IN_FL_NO_IT);
    // ADC gpio's for scan mode
    GPIO_Init(ADC_port, ADC_Multichannel_pins, GPIO_MODE_IN_FL_NO_IT);

  //GPIO_Init(LED_port, LED_pin, GPIO_MODE_OUT_PP_HIGH_FAST);

    // C5=sck  C6=mosi
    GPIO_Init(GPIOC, ((GPIO_Pin_TypeDef)GPIO_PIN_5 | GPIO_PIN_6 ),
               GPIO_MODE_OUT_PP_HIGH_FAST);
}

/*
* Multichannle ADC
Explanation required.

• input impedance of <10K Ohms
• It is better to keep ADC clock within or less than 4MHz
• Schmitt triggers must be disabled.
• Opamp-based input buffer and filter circuits are preferred if possible
• If the ADC has reference source pins, they should be connected to a precision reference source
like LM336. It is recommended to use a good LDO regulator chip otherwise.
• Unused ADC pins should not be configured or disabled. This will reduce power consumption.
• Rather taking single samples, ADC readings should be sampled at fixed regular intervals and averaged to get rid of minute fluctuations in readings.
• Right-justified data alignment should be used as it is most convenient to use.
• PCB/wire tracks leading to ADC channels must be short to reduce interference effects.

*/
// ADC1_CONVERSIONMODE_SINGLE
// ADC1_CONVERSIONMODE_CONTINUOUS

/*
Single mode seems to take the last reading(buff 1) and pass that to both
outputs, leftchannel and delay.

continuous mode seems to take the buffer 0 one and ignore buffer 1 and pass that to leftchannel and delay

*/
void ADC1_setup(void)
{
  ADC1_DeInit();

  ADC1_Init(ADC1_CONVERSIONMODE_SINGLE, \
  ADC1_CHANNEL_0,\
  ADC1_PRESSEL_FCPU_D18, \
  ADC1_EXTTRIG_GPIO, \
  DISABLE, \
  ADC1_ALIGN_RIGHT, \
  ADC1_SCHMITTTRIG_CHANNEL0, \
  DISABLE);

  ADC1_Init(ADC1_CONVERSIONMODE_SINGLE, \
  ADC1_CHANNEL_1,\
  ADC1_PRESSEL_FCPU_D18, \
  ADC1_EXTTRIG_GPIO, \
  DISABLE, \
  ADC1_ALIGN_RIGHT, \
  ADC1_SCHMITTTRIG_CHANNEL1, \
  DISABLE);

  ADC1_ConversionConfig(ADC1_CONVERSIONMODE_SINGLE, ((ADC1_Channel_TypeDef)(ADC1_CHANNEL_0 | ADC1_CHANNEL_1)), ADC1_ALIGN_RIGHT);

  ADC1_DataBufferCmd(ENABLE);
  ADC1_Cmd(ENABLE);

}




void TIM2_setup(void)
{
  /*
  TIM2_DeInit();
  TIM2_TimeBaseInit(TIM2_PRESCALER_32, 1000);
  TIM2_OC1Init(TIM2_OCMODE_PWM1, TIM2_OUTPUTSTATE_ENABLE, 1000, TIM2_OCPOLARITY_HIGH);
  TIM2_Cmd(ENABLE);
  */

/* one timer for us, incase we need it, */
/* one interrupt timer, */


