manrussell/stm8_audio_delay/main.c
}




void SPI_setup(void)
{
  SPI_DeInit();

    //SPI_CLOCKPOLARITY_HIGH, \
    //SPI_CLOCKPOLARITY_LOW clock goes low(idle) to high

  SPI_Init(SPI_FIRSTBIT_MSB, \
    SPI_BAUDRATEPRESCALER_16, \
    SPI_MODE_MASTER, \
    SPI_CLOCKPOLARITY_LOW, \
    SPI_CLOCKPHASE_1EDGE, \
    SPI_DATADIRECTION_2LINES_FULLDUPLEX, \
    SPI_NSS_SOFT, \
    0x0);

  SPI_Cmd(ENABLE);
}

void MCP_23K256_init()
{
    GPIO_Init(RAM_CS_port, RAM_CS_pin, GPIO_MODE_OUT_PP_HIGH_FAST);
  delay_ms(10);
}

/*
*
*/
void MCP_23K256_read_status_register(uint8_t *data)
{

  while(SPI_GetFlagStatus(SPI_FLAG_BSY));

  GPIO_WriteLow(RAM_CS_port, RAM_CS_pin);

  SPI_SendData(RDSR); // read ststus reg

  while(!SPI_GetFlagStatus(SPI_FLAG_TXE));

    //extra
while (SPI_GetFlagStatus(SPI_FLAG_RXNE) == RESET);
SPI_SendData( 255 );
while(!SPI_GetFlagStatus(SPI_FLAG_TXE));

  *data = SPI_ReceiveData();

  while(!SPI_GetFlagStatus(SPI_FLAG_RXNE));

    // this delay was required because i was seeing the cs line
    // going high before the spi data was finished being written
    delay_us(1);

  GPIO_WriteHigh(RAM_CS_port, RAM_CS_pin);
}

/*
* status modes are:
* 00 = byte mode
* 10 = page mode
* 01 = sequential/burst mode
* 11 = reserved
*/
void MCP_23K256_write_status_register(uint8_t data)
{

  while(SPI_GetFlagStatus(SPI_FLAG_BSY));

  GPIO_WriteLow(RAM_CS_port, RAM_CS_pin);

    // write status register
  SPI_SendData(WRSR);
  while(!SPI_GetFlagStatus(SPI_FLAG_TXE));


  SPI_SendData(data);
  while(!SPI_GetFlagStatus(SPI_FLAG_TXE));

    // this delay was required because i was seeing the cs line
    // going high before the spi data was finished being written
    delay_us(1);

  GPIO_WriteHigh(RAM_CS_port, RAM_CS_pin);

}



/*


write instruction = 0000 0010
*/
void MCP_23K256_RAM_write_byte(uint16_t address, unsigned char value)
{
    uint8_t addr = 0;

  while(SPI_GetFlagStatus(SPI_FLAG_BSY));

  GPIO_WriteLow(RAM_CS_port, RAM_CS_pin);

    // send instruction
  SPI_SendData(WRITE); // instruction 2 write
  while(!SPI_GetFlagStatus(SPI_FLAG_TXE));

    //send top 8 bits of address
    addr = address>>8;
  SPI_SendData(addr); // send 16 bit address // MSB is don't care
  while(!SPI_GetFlagStatus(SPI_FLAG_TXE));

    //send bottom 8 bits of address
    addr = (address&255);
  SPI_SendData( addr );
  while(!SPI_GetFlagStatus(SPI_FLAG_TXE));

  SPI_SendData(value);

  while(!SPI_GetFlagStatus(SPI_FLAG_TXE));

    // this delay was required because i was seeing the cs line
    // going high before the spi data was finished being written
    delay_us(1);

  GPIO_WriteHigh(RAM_CS_port, RAM_CS_pin);


}

/*
 read instruction = 0000 0011
*/


void MCP_23K256_RAM_read_byte(uint16_t address, unsigned char *value)
{
    uint8_t addr = 0;

  while(SPI_GetFlagStatus(SPI_FLAG_BSY));

  GPIO_WriteLow(RAM_CS_port, RAM_CS_pin);

  SPI_SendData(READ); // instruction 3 read

  while(!SPI_GetFlagStatus(SPI_FLAG_TXE));

    //send top 8 bits of address
    addr = address>>8;
  SPI_SendData(addr); // send 16 bit address // MSB is don't care
  while(!SPI_GetFlagStatus(SPI_FLAG_TXE));

    //send bottom bits of address
    addr = (address&255);
  SPI_SendData( addr );
  while(!SPI_GetFlagStatus(SPI_FLAG_TXE));

//  SPI_SendData( 6 );
//  while(!SPI_GetFlagStatus(SPI_FLAG_TXE));
while (SPI_GetFlagStatus(SPI_FLAG_RXNE) == RESET);
SPI_SendData( 255 );
while(!SPI_GetFlagStatus(SPI_FLAG_TXE));
while(!SPI_GetFlagStatus(SPI_FLAG_RXNE));

    // read data back
  *value = SPI_ReceiveData();




    // this delay was required because i was seeing the cs line
    // going high before the spi data was finished being written
    delay_us(1);

  GPIO_WriteHigh(RAM_CS_port, RAM_CS_pin);
}

/*
*  initialise the CS pin
*/
void MCP4901_DAC_init(void)
{
  GPIO_Init(DAC_CS_port, DAC_CS_pin, GPIO_MODE_OUT_PP_HIGH_FAST);
  delay_ms(10);
}

/*
*

*/
void MCP4901_DAC_write( unsigned char value)
{

    //0,BUF,GS,SHDN, 8bit data, x,x,x,x
    //0,BUF,GS,SHDN, 4bit data | 4 bits data, x,x,x,x

    //bit 15:
    // 0 write to dac
    // 1 ignore this command

    //bit 14: buf
    // 1=buffered
    // 0= unbuffered

    //bit 13: GA output gain selection bit
    // 1= unity
    // 0= 2 times

    //bit 12: SHDN output shutdown control bit
    // 1= active mode operation
    // 0 shutdown the device

    //

    //address[7] = 0; // write to dac
    //address[6] = 0; // unbuffered
    //address[5] = 1; // unity
    //address[4] = 1; // active

    unsigned char address = 0x30; // 00,11,00,00
    address |= ( value>>4); // assume 0's shoved in the left

    value = ( value<<4 ); // assume 0 shoved in from the right


  while(SPI_GetFlagStatus(SPI_FLAG_BSY));

  GPIO_WriteLow(DAC_CS_port, DAC_CS_pin);

  SPI_SendData(address);

  while(!SPI_GetFlagStatus(SPI_FLAG_TXE));

  SPI_SendData(value);

  while(!SPI_GetFlagStatus(SPI_FLAG_TXE));

    // this delay was required because i was seeing the cs line
    // going high before the spi data was finished being written
    delay_us(1);
    /*for(int i=0;i<1024;i++)
    {
        _asm ("nop");
    }*/


  GPIO_WriteHigh(DAC_CS_port, DAC_CS_pin);

}








#ifdef USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *   where the assert_param error has occurred.
  * @param file: pointer to the source file name
  * @param line: assert_param error line source number
  * @retval : None
  */
void assert_failed(u8* file, u32 line)
{
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {
  }
}
#endif


/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
